<template>
  <div class="about-page">
    <div class="container_xl">
      <div class="new-category-title">
        <h2>{{ $store.state.translations["main.library"] }}</h2>
      </div>
      <div class="news-breadcrumb">
        <nuxt-link :to="localePath('/')"
          >{{ $store.state.translations["main.home"] }} <span v-html="dropdown"></span
        ></nuxt-link>
        <nuxt-link :to="localePath(`/newspaper`)"
          >{{ $store.state.translations["main.newspaper"] }}
          <span v-html="dropdown"></span
        ></nuxt-link>
        <nuxt-link :to="localePath('/')" style="pointer-events: none"
          >auuugghhhhh <span v-html="dropdown"></span
        ></nuxt-link>
      </div>
      <div class="engineers-container">
        <h2>Muassis</h2>
        <p>
          Ўзбекистон касаба уюшмалари федерацияси 1990 йил 12 сентябрда ташкил топган
          бўлиб, ишлаб чиқариш ва ноишлаб чиқариш соҳасидаги фаолият тури бўйича умумий
          манфаатлар билан бирлашган ходимлар, қисман иш билан банд бўлганлар ёки вақтинча
          ишсизлар, талабалар ва ўқувчи ёшлар, пенсионерлар, аҳоли бошқа қатламларини
          бирлаштирган касаба уюшмаларини ўз ичига олади ва ўзини ўзи бошқарадиган
          кўнгилли нодавлат, нотижорат жамоат ташкилоти ҳисобланади.
        </p>
        <div class="about-shadow-card">
          <h4>Касаба уюшмаларининг бош вазифаси</h4>
          <p>
            Касаба уюшмалари аъзоларининг меҳнат, ижтимоий, иқтисодий, маънавий,
            интеллектуал ҳуқуқ ва манфаатларини муҳофаза қилишда ҳаракат бирлигини амалга
            оширишдан иборат.
          </p>
        </div>
        <p>
          Ўзбекистон касаба уюшмалари кенгаши 1925 йилдан фаолият кўрсата бошлаган. Собиқ
          иттифоқ даврида унинг тасарруфида тармоқ республика қўмиталари мавжуд эди. Лекин
          уларнинг биронтаси ўз уставига эга эмасди. Фақат СССР касаба уюшмалари уставига
          биноан фаолият кўрсатарди. Ўзбекистон Республикаси мустақилликка эришгандан сўнг
          республикада тармоқ касаба уюшмалари тузилиб, улар ўз уставларини қабул қилди ва
          Адлия вазирлигида рўйхатдан ўтказди ҳамда Ўзбекистон касаба уюшмалари
          федерациясига уюшди.
        </p>
        <ul>
          <h3>Булар қуйидагилардан иборат:</h3>
          <li>Авиация ходимлари касаба уюшмаси;</li>
          <li>Авиация ходимлари касаба уюшмаси;</li>
          <li>Авиация ходимлари касаба уюшмаси;</li>
          <li>Авиация ходимлари касаба уюшмаси;</li>
          <li>Авиация ходимлари касаба уюшмаси;</li>
          <li>Авиация ходимлари касаба уюшмаси;</li>
          <li>Авиация ходимлари касаба уюшмаси;</li>
          <li>Авиация ходимлари касаба уюшмаси;</li>
          <li>Авиация ходимлари касаба уюшмаси;</li>
        </ul>
        <p>
          Ўзбекистон касаба уюшмалари тизимини бошланғич касаба уюшма ташкилотлари, касаба
          уюшмаларининг туман, шаҳар, вилоят, Қорақалпоғистон Республикаси, Тошкент шаҳри
          кенгашлари ва бошқалар ташкил этади. Федерация кенгаши Ўзбекистон касаба
          уюшмалари федерациясининг қурултойлар оралиғидаги раҳбар органидир. У 5 йил
          муддатга сайланади ва ҳар бир аъзо ташкилотдан тўғридан тўғри микдорда (2 тадан)
          вакил юбориш йўли билан шакллантирилади. Федерация кенгашига вакиллар федерация
          аъзолари бўлган ташкилотларнинг қурултойлари, конференциялари ва мажлисларида
          сайланади. Федерация кенгаши таркибига қурултойда сайланган аъзолар, федерация
          раиси, унинг кенгаш бўйича ўринбосарлари, федерация фаолиятининг асосий
          йўналишлари бўйича доимий фаолият кўрсатувчи комиссиялар раислари ки]эади.
          Федерация раиси айни вақтда Ўзбекистон касаба уюшмалари федерацияси кенгаши,
          Раёсат ва Ижроия қўмита раиси ҳам ҳисобланади. Федерация кенгашининг мажлиси
          заруратга қараб, лекин ҳар йили камида 1 марта чақирилади.
        </p>
        <p>
          Федерация кенгаши уюшмалараро ва минтақалараро вазифаларни ҳал этишда аъзо
          ташкилотларнинг фаолиятини мувофиқлаштиради, касаба уюшмаларига қонунчиликда
          бериб қўйилган ҳуқуқларни рўёбга чиқаради, барча даражадаги касаба уюшмалари
          ташкилотларида ягона молиявий фаолиятни ва интизомни белгилайди ҳамда ўрнатади
          ҳамда федерациянинг халқаро фаолиятини олиб боради. Федерация кенгаши девонида
          меҳнаткашларнинг ижтимоий-иқтисодий манфаатларини ҳимоя қилиш, маданий-маърифий
          ва спорт ишлари, юридик, халқаро ишлар, ташкилий ишлар, ижтимоий суғурта, молия
          бўлимлари, котибият ҳамда ишлар бошқармаси бор.
        </p>
        <div class="about-statistic">
          <p>
            Бошланғич ташкилотлар сони
            <span>28 355</span>
          </p>
          <p>
            Касаба уюшма аъзолари сони
            <span>6 336 611</span>
          </p>
        </div>
        <p>
          Касаба уюшмалари тизимида 28 355 та бошланғич ташкилот бўлиб, улар 6 336 611
          нафар касаба уюшма аъзосини бирлаштиради. Бошланғич касаба уюшма ташкилотларида
          умумий йиғилиш (конференция), тармоқ касаба уюшмаларининг туман, шаҳар, вилоят
          ташкилотлари ва Қорақалпоғистон Республикаси, Тошкент шаҳри ҳамда вилоятлар
          уюшмалараро бирлашмаларида конференция, тармоқ касаба уюшмалари ва Ўзбекистон
          касаба уюшмалари федерациясида қурултой олий орган ҳисобланади. Умумий йиғилиш,
          конференция ва қурултой 5 йилда камида 1 марта чақирилади.
        </p>
        <p>
          Ўзбекистон касаба уюшмаларининг асосий эътибори меҳнаткашлар онгида демократик
          қадриятларни мустаҳкамлаш, уларнинг фаоллигини ошириш, касаба уюшмалари
          ҳаракатида демократик ўзгаришларни чуқурлаштиришга қаратилган. Жамоа шартномавий
          муносабатларни ривожлантириш борасидаги фаолият натижасида жамоа шартномалари
          тузилган юридик шахслар сони кўпайди. Жамоа шартномаларининг ижтимоий функцияси
          кучайди, уларнинг иш ҳақи ва ходимларнинг даромадига таъсири ошди. Самарали
          бандлик, меҳнатга ҳақ тўлашнинг ижтимоий адолатли тизимини жорий этиш, меҳнатни
          меъёрлаш масалаларига алоҳида эътибор қаратилди. Иш жойларида соғлом ва бехатар
          меҳнат шароитлари яратилиши борасида ташкилий ишлар амалга оширилди, кўп
          ҳолларда ходимларнинг бузилган ҳуқуқларини тиклашга эришилди. Касаба
          уюшмаларининг аёллар ва ёшларни, шунингдек, ижтимоий ҳимояга муҳтож ногиронлар,
          пенсионерлар, байналмилалчи жангчиларнинг ҳуқуқ ҳамда манфаатларини ҳимоя
          қилишга эътибор кучайди. Қонун яратувчилик соҳасида Олий Мажлис қўмиталари ва
          комиссиялари билан ҳамкорликда касаба уюшмаларининг фаол иштироки таъминланди.
          Ижтимоий суғурта маблағларини бошқариш механизми такомиллаштирилиши, янги
          соғломлаштириш муассасалари қурилиши ва мавжудларини реконструкция қилиш
          натижасида ходимлар ва улар оила аъзоларини соғломлаштиришда ижобий ўзгаришларга
          эришилди.
        </p>
        <p>
          Ўзбекистон касаба уюшмалари чет эл миллий касаба уюшмалари марказлари, жаҳон
          ишчилар ҳаракатининг етакчиси Халқаро эркин касаба уюшмалари конфедерацияси
          ҳамкорлигида Франция Меҳнат демократик федерацияси, Америка Меҳнат федерацияси,
          Бельгия эркин касаба уюшмалари умумий бирлашмаси, Австрия касаба уюшмалари
          федерацияси билан ҳамкорлик алоқалари ўрнатган. Шунингдек, Хитой, Япония,
          Ҳиндистон мамлакатлари касаба уюшмалари билан алоқалар мустаҳкамланиб бормоқда.
          Касаба уюшмаларининг ҳаракат дастурида Халқаро меҳнат ташкилоти билан халқаро
          ҳамкорлик муҳим ўрин тутади. Ўзбекистон Республикаси томонидан бу ташкилотнинг
          11 та конвенцияси ратификация қилинган.
        </p>
        <p>
          Ўзбекистон касаба уюшмалари федерацияси, ўз навбатида, “Ишонч” (ўзбек тилида
          ҳафтасига 3 марта чиқади) ва “Ишонч-Доверие” (рус тилида, ҳафтасига 1 марта
          чиқади) газеталари ҳамда “ishonch.uz” ахборот-таҳлилий портали муассиси ҳамдир.
        </p>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      dropdown: require("../../assets/svg/dropdown.svg?raw"),
    };
  },
  async asyncData({ store, i18n }) {
    const [literatureData] = await Promise.all([
      store.dispatch("fetchBooks/getBooks", {
        params: {
          type: "literature",
        },
        headers: {
          Language: i18n.locale,
        },
      }),
    ]);
    const literature = literatureData.results;
    return {
      literature,
    };
  },
};
</script>
<style lang="css">
@import "../../assets/css/pages/home-page.css";
@import "../../assets/css/pages/news-menu-page.css";
@import "../../assets/css/pages/site-info.css";
</style>
